app/Controllers/Clientes.php

SELECT *
FROM `persona`
WHERE `idpersona` = '2'
 LIMIT 1
---
    public function verRegistro($id)
    {
        $data["usuario"] = $this->usuario->where('idpersona', $id)->first();