app/Controllers/Producto.php

    public function index()
    {
        $data["producto"] = $this->producto->getProducto(1);
        $data["categoria"] = $this->categoria->findAll();
---
SELECT *
FROM `categoria`

    public function registrar()
    {
        $data["producto"] = $this->producto->findAll();
        $data["categoria"] = $this->categoria->findAll();
---
SELECT *
FROM `producto`
SELECT *
FROM `categoria`

    public function verRegistro($id)
    {
        $data["producto"] = $this->producto->where("idproducto", $id)->first();
        $data["categoria"] = $this->categoria->findAll();
---
SELECT *
FROM `producto`
WHERE `idproducto` = '1'
 LIMIT 1
SELECT *
FROM `categoria`