app/Controllers/Usuarios.php

SELECT *
FROM `persona`
WHERE `idpersona` = '1'
 LIMIT 1
---
    public function verRegistro($id)
    {
        $data["usuario"] = $this->usuario->where('idpersona', $id)->first();