app/Controllers/Venta.php

SELECT *
FROM `venta`
SELECT *
FROM `producto`
SELECT *
FROM `tipopago`
SELECT *
FROM `detalleventa`
---
    public function index()
    {
        $data["venta"] = $this->venta->findAll();
        $data["producto"] = $this->producto->findAll();
        $data["persona"] = $this->persona->getPersona(3);
        $data["tipopago"] = $this->tipopago->findAll();
        $data["detalleventa"] = $this->detalleVenta->findAll();

SELECT *
FROM `persona`
SELECT *
FROM `tipopago`
---
    public function listarVenta(){
        $fechainicio  = $this->request->getPost("fechainicio");
        $fechafin  = $this->request->getPost("fechafin");

        if ($this->request->getPost("buscar")) {
            $cajaRes = $this->venta->getVentasbyDate($fechainicio, $fechafin);
        } else {
            $cajaRes = $this->venta->getVenta();
        }

        $data["venta"] = $cajaRes;
        $data["fechainicio"] = $fechainicio;
        $data["fechafin"] = $fechafin;
        $data["persona"] = $this->persona->findAll();
        $data["tipopago"] = $this->tipopago->findAll();

SELECT *
FROM `persona`
SELECT *
FROM `tipopago`
---
    public function verVenta($id){
        $data["venta"] = $this->venta->getIdVenta($id);
        $data["persona"] = $this->persona->findAll();
        $data["tipopago"] = $this->tipopago->findAll();